Repeat the activity that we just went through in the lecture to read the data from the provided State Data. Transform the data.

state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}

1. Create a dataframe using pd.DataFrame(state_data, columns=['State','PostCode','Area','Pop'].

2. Display the table.

3. Index the table by 'State'.

4. Replace the '*' with '0'.

5. Define a function to replace ',' with ''.

6. Use this function to replace the commas in 'Area' and 'Pop'.

Submit your code and a final display of your table.

In [1]:
#create state data
state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}

In [9]:
#create data data frame
import pandas as pd

stdf = pd.DataFrame(state_data, columns=['State', 'PostCode','Area','Pop'])

stdf

      State PostCode     Area        Pop
0   Alabama       AL   52,423  4,040,587
1    Alaska       AK  656,424    550,043
2   Arizona       AZ        *  3,665,228
3  Arkansas       AR   53,182  2,350,750

In [10]:
#index table by state

stdf = stdf.set_index('State')

stdf

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        *  3,665,228
Arkansas       AR   53,182  2,350,750

In [11]:
#4. Replace the '*' with '0'.

stdf = stdf.replace('*', '0')

stdf

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        0  3,665,228
Arkansas       AR   53,182  2,350,750

In [12]:
#5. Define a function to replace ',' with ''.

def replace_comma(xdf):
    return xdf.replace(',', '')

In [15]:
#6. Use this function to replace the commas in 'Area' and 'Pop'.

stdf['Area'] = stdf['Area'].map(replace_comma)
stdf['Pop'] = stdf['Pop'].map(replace_comma)

stdf

         PostCode    Area      Pop
State
Alabama        AL   52423  4040587
Alaska         AK  656424   550043
Arizona        AZ       0  3665228
Arkansas       AR   53182  2350750